#include <stdio.h>//підключення бібліотек
#include <Windows.h>
#include <iostream>

void output(int start, int end){//функція
	int i = start;//задаємо змінну 
	for (; i <= start + 2; i++) {//визначаємо значення першого кратного трьом числа
		if (i % 3 == 0) {//коли знаходимо це значення
			break;//завершуємо цикл
		}
	}
	for (; i <= end; i += 3) {//виводимо всі значення кратні трьом, що належать діапазону
		printf("[%i] ", i);
	}
}

int main() {

	SetConsoleCP(1251);//підключення української мови
	SetConsoleOutputCP(1251);
	int p, k;
	std::cout << "Введіть початок діапазону\n";//виводимо повідомлення з проханням ввести змінну
	std::cin >> p;//отримуємо значення змінної від користувача
	std::cout << "Введіть кінець діапазону\n";
	std::cin >> k;
	if (p < k) {//якщо "початок" діапазону менший за "кінець"
		output(p, k);//задаємо значення у відповідному порядку
	}
	else{//випадок, в якому користувач ввів початкове значення більше за кінцеве
		output(k, p);
	}
	
	return 0;
}